#pragma once

#include "math/cpumath.h"

namespace RMath {


namespace RGeoMath {



//------------------------------------------------------------------------------
//                ФУНКЦИИ ПРЕОБРАЗОВАНИЯ СИСТЕМ КООРДИНАТ                      |
//------------------------------------------------------------------------------




//полигонные пересчёты
namespace GIP10 {



//------------------------------------------------------------------------------
/*!
 * \brief Пересчет из Стартовой СК в МПСК
 * \param iX координаты вектора положения в Стартовой СК
 * \param iY координаты вектора положения в Стартовой СК
 * \param iZ координаты вектора положения в Стартовой СК
 * \param iVX координаты вектора скорости в Стартовой СК
 * \param iVY координаты вектора скорости в Стартовой СК
 * \param iVZ координаты вектора скорости в Стартовой СК
 * \param oX МПСК координаты [м]
 * \param oY МПСК координаты [м]
 * \param oZ МПСК координаты [м]
 * \param oVX производные МПСК координат [м/с]
 * \param oVY производные МПСК координат [м/с]
 * \param oVZ производные МПСК координат [м/с]
 * \param ichannel_number номер канала
 */
bool stsk2mpsk(const T &iX, const T &iY, const T &iZ,
               const T &iVX, const T &iVY, const T &iVZ,
               T &oX, T &oY, T &oZ, T &oVX, T &oVY, T &oVZ,
               size_t ichannel_number);


//------------------------------------------------------------------------------
/*!
 * \brief Пересчет из МПСК в Стартовую СК
 * \param iX координаты вектора положения в МПСК
 * \param iY координаты вектора положения в МПСК
 * \param iZ координаты вектора положения в МПСК
 * \param iVX координаты вектора скорости в МПСК
 * \param iVY координаты вектора скорости в МПСК
 * \param iVZ координаты вектора скорости в МПСК
 * \param oX координаты в Стартовой СК [м]
 * \param oY координаты в Стартовой СК [м]
 * \param oZ координаты в Стартовой СК [м]
 * \param oVX производные координат в Стартовой СК [м/с]
 * \param oVY производные координат в Стартовой СК [м/с]
 * \param oVZ производные координат в Стартовой СК [м/с]
 * \param ichannel_number номер канала
 */
bool mpsk2stsk(const T &iX, const T &iY, const T &iZ,
               const T &iVX, const T &iVY, const T &iVZ,
               T &oX, T &oY, T &oZ, T &oVX, T &oVY, T &oVZ,
               size_t ichannel_number);




//------------------------------------------------------------------------------
/*!
 * \brief Пересчет из АПСК в МПСК
 * \param iX координаты вектора положения в АПСК
 * \param iY координаты вектора положения в АПСК
 * \param iZ координаты вектора положения в АПСК
 * \param iVX координаты вектора скорости в АПСК
 * \param iVY координаты вектора скорости в АПСК
 * \param iVZ координаты вектора скорости в АПСК
 * \param oX МПСК координаты [м]
 * \param oY МПСК координаты [м]
 * \param oZ МПСК координаты [м]
 * \param oVX производные МПСК координат [м/с]
 * \param oVY производные МПСК координат [м/с]
 * \param oVZ производные МПСК координат [м/с]
 * \param nEdge номер грани МРЛС
 */
bool apsk2mpsk(const T &iX,  const T &iY,  const T &iZ,
               const T &iVX, const T &iVY, const T &iVZ,
               T &oX, T &oY, T &oZ, T &oVX, T &oVY, T &oVZ,
               ruint32 nEdge);

//------------------------------------------------------------------------------
/*!
 * \brief Пересчет из МПСК в АПСК
 * \param iX координаты вектора положения в АПСК
 * \param iY координаты вектора положения в АПСК
 * \param iZ координаты вектора положения в АПСК
 * \param iVX координаты вектора скорости в АПСК
 * \param iVY координаты вектора скорости в АПСК
 * \param iVZ координаты вектора скорости в АПСК
 * \param oX МПСК координаты [м]
 * \param oY МПСК координаты [м]
 * \param oZ МПСК координаты [м]
 * \param oVX производные МПСК координат [м/с]
 * \param oVY производные МПСК координат [м/с]
 * \param oVZ производные МПСК координат [м/с]
 * \param nEdge номер грани МРЛС
 */
bool mpsk2apsk(const T &iX,  const T &iY,  const T &iZ,
               const T &iVX, const T &iVY, const T &iVZ,
               T &oX, T &oY, T &oZ, T &oVX, T &oVY, T &oVZ,
               ruint32 nEdge);

}




//пересчёты на системе
namespace SOFRINO {



//------------------------------------------------------------------------------
/*!
 * \brief Пересчет из Стартовой СК в МПСК
 * \param iX координаты вектора положения в Стартовой СК
 * \param iY координаты вектора положения в Стартовой СК
 * \param iZ координаты вектора положения в Стартовой СК
 * \param iVX координаты вектора скорости в Стартовой СК
 * \param iVY координаты вектора скорости в Стартовой СК
 * \param iVZ координаты вектора скорости в Стартовой СК
 * \param oX МПСК координаты [м]
 * \param oY МПСК координаты [м]
 * \param oZ МПСК координаты [м]
 * \param oVX производные МПСК координат [м/с]
 * \param oVY производные МПСК координат [м/с]
 * \param oVZ производные МПСК координат [м/с]
 * \param ichannel_number номер канала
 */
bool stsk2mpsk(const T &iX, const T &iY, const T &iZ,
               const T &iVX, const T &iVY, const T &iVZ,
               T &oX, T &oY, T &oZ, T &oVX, T &oVY, T &oVZ,
               size_t ichannel_number);


//------------------------------------------------------------------------------
/*!
 * \brief Пересчет из МПСК в Стартовую СК
 * \param iX координаты вектора положения в МПСК
 * \param iY координаты вектора положения в МПСК
 * \param iZ координаты вектора положения в МПСК
 * \param iVX координаты вектора скорости в МПСК
 * \param iVY координаты вектора скорости в МПСК
 * \param iVZ координаты вектора скорости в МПСК
 * \param oX координаты в Стартовой СК [м]
 * \param oY координаты в Стартовой СК [м]
 * \param oZ координаты в Стартовой СК [м]
 * \param oVX производные координат в Стартовой СК [м/с]
 * \param oVY производные координат в Стартовой СК [м/с]
 * \param oVZ производные координат в Стартовой СК [м/с]
 * \param ichannel_number номер канала
 */
bool mpsk2stsk(const T &iX, const T &iY, const T &iZ,
               const T &iVX, const T &iVY, const T &iVZ,
               T &oX, T &oY, T &oZ, T &oVX, T &oVY, T &oVZ,
               size_t ichannel_number);


//------------------------------------------------------------------------------
/*!
 * \brief Пересчет из АПСК в МПСК
 * \param iX координаты вектора положения в АПСК
 * \param iY координаты вектора положения в АПСК
 * \param iZ координаты вектора положения в АПСК
 * \param iVX координаты вектора скорости в АПСК
 * \param iVY координаты вектора скорости в АПСК
 * \param iVZ координаты вектора скорости в АПСК
 * \param oX МПСК координаты [м]
 * \param oY МПСК координаты [м]
 * \param oZ МПСК координаты [м]
 * \param oVX производные МПСК координат [м/с]
 * \param oVY производные МПСК координат [м/с]
 * \param oVZ производные МПСК координат [м/с]
 * \param nEdge номер грани МРЛС
 */
bool apsk2mpsk(const T &iX,  const T &iY,  const T &iZ,
               const T &iVX, const T &iVY, const T &iVZ,
               T &oX, T &oY, T &oZ, T &oVX, T &oVY, T &oVZ,
               ruint32 nEdge);

//------------------------------------------------------------------------------
/*!
 * \brief Пересчет из МПСК в АПСК
 * \param iX координаты вектора положения в АПСК
 * \param iY координаты вектора положения в АПСК
 * \param iZ координаты вектора положения в АПСК
 * \param iVX координаты вектора скорости в АПСК
 * \param iVY координаты вектора скорости в АПСК
 * \param iVZ координаты вектора скорости в АПСК
 * \param oX МПСК координаты [м]
 * \param oY МПСК координаты [м]
 * \param oZ МПСК координаты [м]
 * \param oVX производные МПСК координат [м/с]
 * \param oVY производные МПСК координат [м/с]
 * \param oVZ производные МПСК координат [м/с]
 * \param nEdge номер грани МРЛС
 */
bool mpsk2apsk(const T &iX,  const T &iY,  const T &iZ,
               const T &iVX, const T &iVY, const T &iVZ,
               T &oX, T &oY, T &oZ, T &oVX, T &oVY, T &oVZ,
               ruint32 nEdge);



//------------------------------------------------------------------------------
/*!
 * \brief Пересчет из ОБСК в МПСК
 * \param iR координаты вектора положения в ОБСК
 * \param iU координаты вектора положения в ОБСК
 * \param iV координаты вектора положения в ОБСК
 * \param idR координаты вектора скорости в ОБСК
 * \param idU координаты вектора скорости в ОБСК
 * \param idV координаты вектора скорости в ОБСК
 * \param oX МПСК координаты [м]
 * \param oY МПСК координаты [м]
 * \param oZ МПСК координаты [м]
 * \param oVX производные МПСК координат [м/с]
 * \param oVY производные МПСК координат [м/с]
 * \param oVZ производные МПСК координат [м/с]
 * \param i_NK номер канала (макс. 68)
 * \param i_startNK номер первого канала(1 или 33)
 * \param nEdge номер грани МРЛС
 */
bool obsk2mpsk(const T &iR,  const T &iU,  const T &iV,
               const T &idR, const T &idU, const T &idV,
               T &oX, T &oY, T &oZ, T &oVX, T &oVY, T &oVZ,
               rint32 i_NK, rint32 i_startNK, rint32 nEdge);


//------------------------------------------------------------------------------
/*!
 * \brief Пересчет из МПСК в ОБСК
 * \param iX координаты вектора положения в МПСК
 * \param iY координаты вектора положения в МПСК
 * \param iZ координаты вектора положения в МПСК
 * \param iVX координаты вектора скорости в МПСК
 * \param iVY координаты вектора скорости в МПСК
 * \param iVZ координаты вектора скорости в МПСК
 * \param oR координаты в ОБСК [м]
 * \param oU координаты в ОБСК [м]
 * \param oV координаты в ОБСК [м]
 * \param odR производные координат в ОБСК [м/с]
 * \param odU производные координат в ОБСК [м/с]
 * \param odV производные координат в ОБСК [м/с]
 * \param i_NK номер канала (макс. 68)
 * \param i_startNK номер первого канала(1 или 33)
 * \param nEdge номер грани МРЛС
 */
bool mpsk2obsk(const T &iX, const T &iY, const T &iZ,
               const T &iVX, const T &iVY, const T &iVZ,
               T &oR, T &oU, T &oV, T &odR, T &odU, T &odV,
               rint32 i_NK, rint32 i_startNK, rint32 &nEdge);

}



} //namespace RGeoMath

} //namespace RMath

